[
 {
  "name": "Beach Shorts",
  "price": "40",
  "countInStock": "1",
  "color": "Black",
  "category": "Clothing",
  "description": "Splashing in the surf. Making memories with your friends. Beach days are the best days. These shorts are made of stretchy woven fabric. An elastic waistband that features the adidas logo brings a sporty look to your day at the beach.",
  "brand": "adidas",
  "image": "/images/product_1_bike_shorts.jpg",
  "rating": "4.5",
  "numReviews": "35"
 },
 {
  "name": "Five Ten Kestrel Lace Mountain Bike Shoes",
  "price": "150",
  "countInStock": "5",
  "color": "Grey",
  "category": "Shoes",
  "description": "Lace up and get after it. The Five Ten Kestrel Lace Mountain Bike Shoes offer efficient pedal power with low-profile style. The wide platform is compatible with all clipless pedals and offers high-friction grip on and off the bike. You'll find the find comfort and versatility for extended trail rides and afterwork hot laps alike.",
  "brand": "adidas",
  "image": "/images/product_2_five_ten_Kestrel_lace_mountain_bike_shoes.jpg",
  "rating": "4.8",
  "numReviews": "4"
 },
 {
  "name": "Mexico Away Jersey",
  "price": "70",
  "countInStock": "7",
  "color": "White",
  "category": "Clothing",
  "description": "Clean and crisp, this adidas Mexico Away Jersey for juniors displays a design that began life in an artist's studio. Soft, quick-drying fabric keeps you comfortable. Standing out on the chest, a team badge lets fans show pride in their soccer team.",
  "brand": "adidas",
  "image": "/images/product_3_Mexico_Away_jersey.jpg",
  "rating": "4.9",
  "numReviews": "42"
 },
 {
  "name": "Five Ten Hiangle Pro Competition Climbing Shoes",
  "price": "160",
  "countInStock": "4",
  "color": "Black",
  "category": "Shoes",
  "description": "The Hiangle Pro takes on the classic shape of the original Hiangle with the addition of a seamless outsole wrapping around the toes, allowing for maximum rubber contact when tackling the most challenging boulder problems.",
  "brand": "adidas",
  "image": "/images/product_4_hiangle_pro_shoes.jpg",
  "rating": "3.7",
  "numReviews": "7"
 },
 {
  "name": "Mesh Broken-Stripe Polo Shirt",
  "price": "65",
  "countInStock": "1",
  "color": "Blue",
  "category": "Clothing",
  "description": "Step up to the tee relaxed. This adidas golf polo shirt lets you focus on accurate drives and putts. Four-way stretch matches the body's natural movements. Breathable fabric keeps you comfortable spring, summer and fall. Recycled materials are one step towards reducing plastic waste.",
  "brand": "adidas",
  "image": "/images/product_5_mesh_broken_stripe_polo_shirt.jpg",
  "rating": "4.7",
  "numReviews": "11"
 },
 {
  "name": "EQT Spikeless Golf Shoes",
  "price": "110",
  "countInStock": "3",
  "color": "Grey",
  "category": "Shoes",
  "description": "Put comfort first. These adidas spikeless golf shoes combine a Bounce midsole and a Boost heel for a lightweight, responsive feel that helps you convert bogie's to birdies. They repel water to keep your feet dry through wet fairways. The versatile rubber outsole ensures easy transitions from your final putt to cold drinks at the clubhouse. Recycled materials are one step towards reducing plastic waste.",
  "brand": "adidas",
  "image": "/images/product_6_EQT_Spikeless_Golf_Shoes.jpg",
  "rating": "4.9",
  "numReviews": "30"
 },
 {
  "name": "Adicross Hybrid Shorts",
  "price": "80",
  "countInStock": "2",
  "color": "Black",
  "category": "Clothing",
  "description": "On the golf course, comfort is an essential component of keeping your concentration locked in on each shot. Stay focused as the temperature heats up with these ultra-lightweight adidas shorts. Move naturally through your round from the first tee to the 18th green. Then head for the clubhouse feeling ready for whatever comes next.",
  "brand": "adidas",
  "image": "/images/product_7_adicross_hybrid_shorts.jpg",
  "rating": "4.5",
  "numReviews": "17"
 },
 {
  "name": "Tiro 21 Windbreaker",
  "price": "60",
  "countInStock": "9",
  "color": "Black",
  "category": "Clothing",
  "description": "You can't always be a force of nature in soccer training. So when the intensity drops and the winds pick up, this juniors' adidas Tiro 21 Windbreaker has you covered. Moisture-absorbing AEROREADY and a mesh lining keep you dry. The streamlined silhouette ensures nothing gets in the way of your ball skills on the touchline. This product is made with recycled content as part of our ambition to end plastic waste.",
  "brand": "adidas",
  "image": "/images/product_8_tiro_21_windbreaker.jpg",
  "rating": "4.5",
  "numReviews": "16"
 },
 {
  "name": "Classic 3-Stripes Swimsuit",
  "price": "40",
  "countInStock": "9",
  "color": "Black",
  "category": "Clothing",
  "description": "You can show your concern for the health of the oceans while you increase your fitness in the pool. This adidas swimsuit is designed for comfort and support. Soft and fully lined, it's made with yarn spun from recycled materials. Iconic 3-Stripes tape on the sides gives it a sporty and classic look.",
  "brand": "adidas",
  "image": "/images/product_9_classic_3Stripes_swimsuit.jpg",
  "rating": "4.5",
  "numReviews": "35"
 },
 {
  "name": "Formotion Sculpt Biker Short Tights",
  "price": "60",
  "countInStock": "7",
  "color": "Black",
  "category": "Clothing",
  "description": "Sometimes confidence comes in a surprising form. These adidas short tights have a unique sculpted shape to hold you in and targeted compression zones that support your muscles as you bend and stretch. If a compression look is not your thing, order a size up. An adaptive FORMOTION design follows your natural movement for a better fit and greater comfort in motion. A high-rise waist helps you focus, even before class begins.",
  "brand": "adidas",
  "image": "/images/product_10_formation_sculpt_biker_short_tights.jpg",
  "rating": "4.4",
  "numReviews": "26"
 },
 {
  "name": "Athletic Cushioned Crew Socks 6 Pairs",
  "price": "20",
  "countInStock": "7",
  "color": "White",
  "category": "Accessories",
  "description": "Stop searching for the lost match to your favorite socks. With six pairs of matching socks, you'll always have a set. These adidas crew socks support your feet with foot-hugging arch support. The stretch blend pulls moisture away from the skin to keep feet feeling dry.",
  "brand": "adidas",
  "image": "/images/product_11_Athletic_Cushioned_Crew_Socks_6_Pairs_Multicolor_Q10386_03_standard.jpg",
  "rating": "4",
  "numReviews": "5"
 },
 {
  "name": "Inter Miami CF Home Authentic Jersey",
  "price": "70",
  "countInStock": "2",
  "color": "White",
  "category": "Clothing",
  "description": "The future's a blank canvas. When Inter Miami CF step out in front of the home crowd, they'll wear a white uniform that shines under the Florida sun. This adidas soccer jersey is a juniors' version of their official home shirt. It keeps you dry on the training ground, though it's clean enough to wear on the street. The lightweight fabric displays embossed herons and sunset-pink details.",
  "brand": "adidas",
  "image": "/images/product_12_Inter_Miami_CF_Home_Authentic_Jersey.jpg",
  "rating": "5",
  "numReviews": "2"
 },
 {
  "name": "Cushioned Mid-Crew Socks 2 Pairs",
  "price": "14",
  "countInStock": "5",
  "color": "Black",
  "category": "Accessories",
  "description": "To get serious about training, start from the ground up. Give your feet the cushioned support and moisture-absorbing comfort of these adidas mid-cut crew socks. They have a Traxion footbed for a secure, no-slip fit as you train.",
  "brand": "adidas",
  "image": "/images/product_13_Cozy_Mid-Cut_Crew_Socks_2_Pairs_Beige_HL9423_03_standard.jpg",
  "rating": "4.8",
  "numReviews": "21"
 },
 {
  "name": "Tour Camo-Print Hat",
  "price": "30",
  "countInStock": "6",
  "color": "Blue",
  "category": "Accessories",
  "description": "Whether you prefer to dress it up or keep it casual, this adidas golf hat adds the finishing touch to any look on the links. Block your face from the bright sun as you eye the green. Play through in comfort and head for the clubhouse in versatile, street-inspired style. This product is made with Primegreen, a series of high-performance recycled materials.",
  "brand": "adidas",
  "image": "/images/product_14_Tour_Camo-Print_Hat_Green_GM7498_01_standard.jpg",
  "rating": "5",
  "numReviews": "19"
 },
 {
  "name": "Essentials Loose Logo Tank Top",
  "price": "20",
  "countInStock": "6",
  "color": "Pink",
  "category": "Clothing",
  "description": "What's on the agenda? Whether it's a quick lunch hour workout or a casual hang, you're covered with this adidas tank top. The fit is not too tight and not too loose just perfectly comfortable. The high neck keeps things covered up front, and the racerback shows off your sports bra while also making sure you have a full range of motion.",
  "brand": "adidas",
  "image": "/images/product_15_essentials_loose_logo_tank_top.jpg",
  "rating": "4.8",
  "numReviews": "116"
 },
 {
  "name": "Superstar Shoes",
  "price": "50",
  "countInStock": "9",
  "color": "White",
  "category": "Shoes",
  "description": "Ready to shine. Whether they're watching a game from the sidelines or taking their first steps towards shooting hoops themselves, these shoes will set your infant up for success. Ever since 1970, when the adidas Superstar shoe first appeared on the basketball court, they've held their place as an icon. This version shines with iridescent 3-Stripes. Elastic laces allow for easy on and off.",
  "brand": "adidas",
  "image": "/images/product_16_superstar_shoes.jpg",
  "rating": "4.8",
  "numReviews": "46"
 },
 {
  "name": "Marvel X Ghosted.3 Firm Ground Cleats",
  "price": "64",
  "countInStock": "9",
  "color": "Blue",
  "category": "Shoes",
  "description": "X has mutated to give you superhuman acceleration. These limited-edition adidas soccer cleats fire a classic comic book character onto the pitch. Cyclops and Marvel X-Men graphics light up the semi-transparent and foot-hugging Speedskin upper as well as the insole. The low-cut silhouette with signature Clawcollar shape locks your foot in for match-long stability and support. The stretchy tongue ensures you can get into them in a flash.",
  "brand": "adidas",
  "image": "/images/product_17_marvel_x_ghosted3_firm_ground_cleats.jpg",
  "rating": "4.4",
  "numReviews": "160"
 },
 {
  "name": "Pureboost 21 Shoes",
  "price": "91",
  "countInStock": "6",
  "color": "Purple",
  "category": "Shoes",
  "description": "For quick morning miles and more. These adidas Pureboost performance running shoes are so simple, you'll want to wear them beyond your daily run. With responsive BOOST, the comfort is clear as soon as you slip them on. The soft knit upper comes with an external heel counter, which locks your foot in place as you run down that last hill.",
  "brand": "adidas",
  "image": "/images/product_18_pureboost_21_shoes.jpg",
  "rating": "4.5",
  "numReviews": "63"
 },
 {
  "name": "Lite Racer BYD 2.0 Shoes",
  "price": "56",
  "countInStock": "9",
  "color": "Grey",
  "category": "Shoes",
  "description": "Simplicity, versatility and comfort. Lace up these running-inspired shoes on action-filled days. They're quick to slip on when you're racing out the door. The rubber outsole gives you traction on slippery and uneven surfaces. A Cloudfoam midsole is for a soft feel and all-day cushioning. This product is made with Primegreen, a series of high-performance recycled materials. 50% of the upper is recycled content. No virgin polyester.",
  "brand": "adidas",
  "image": "/images/product_19_lite_racer_byd_2.0_shoes.jpg",
  "rating": "4.6",
  "numReviews": "135"
 },
 {
  "name": "Adilette Shower Slides",
  "price": "20",
  "countInStock": "5",
  "color": "Pink",
  "category": "Shoes",
  "description": "When you hit the pool, there's only one thing you need: these adidas slides. Okay, and a bathing suit. The point is, there's no need to pack a separate pair of shoes in your gym bag. All your pre- and post-pool comfort is right here. The slides dry quickly, so hop out of the shower and straight into them before taking on the rest of the day.",
  "brand": "adidas",
  "image": "/images/product_20_adilette_shower_slides.jpg",
  "rating": "4.6",
  "numReviews": "327"
 },
 {
  "name": "Messi Mini Ball ",
  "price": "10",
  "countInStock": "4",
  "color": "White",
  "category": "Accessories",
  "description": "A Messi Mini Soccer Ball that tells the story of a pivotal connection. A bond like no other. This adidas mini ball showcases Lionel Messi's relationship with soccer. The graphics on each panel narrate his trajectory from novice to superstar. A foam core means it's always ready to roll. The Messi logo gives it the ultimate seal of approval.",
  "brand": "adidas",
  "image": "/images/product_21_messi_mini_ball.jpg",
  "rating": "5",
  "numReviews": "10"
 },
 {
  "name": "Copa Sense.3 Turf Shoes",
  "price": "64",
  "countInStock": "2",
  "color": "White",
  "category": "Shoes",
  "description": "In the cage. On the court. When the walls close in, your senses take over. Let Copa Sense elevate your touch as you switch up your game. The stretchy collar on these adidas soccer shoes makes for easy entry and a secure fit. Once on, the anatomically designed upper keeps you firmly locked in. Soft and durable, the leather forefoot brings step-in comfort and a touch that buys you time on the busiest courts.",
  "brand": "adidas",
  "image": "/images/product_22_copa_sense_3_turf_shoes.jpg",
  "rating": "4.3",
  "numReviews": "106"
 },
 {
  "name": "Best Version of Myself Slogan Graphic Tank Top",
  "price": "18",
  "countInStock": "10",
  "color": "Yellow",
  "category": "Clothing",
  "description": "Every day brings a new opportunity to be the best version of yourself. The inspirational graphic on this adidas tank top reminds you to strive to be a little bit better than the day before. Reach for that goal in comfort, thanks to the racerback design and moisture-absorbing AEROREADY technology. By buying cotton products from us, you're supporting more sustainable cotton farming. This product is made with recycled content as part of our ambition to end plastic waste.",
  "brand": "adidas",
  "image": "/images/product_23_best_version_of_myself_tank_top.jpg",
  "rating": "4.4",
  "numReviews": "7"
 },
 {
  "name": "Essentials 3-Stripes Full-Zip Hoodie",
  "price": "44",
  "countInStock": "3",
  "color": "Green",
  "category": "Clothing",
  "description": "There are a lot of things we compromise on in life. Comfort isn't one of them. Not with this adidas hoodie, at least. It's made from soft, stretchy cotton to make sure nothing limits your movements. Whether you're warming up or laying low, the casual layer keeps you feeling good on all fronts.",
  "brand": "adidas",
  "image": "/images/product_24_essentials_3Stripes_fullzip_hoodie.jpg",
  "rating": "5",
  "numReviews": "21"
 },
 {
  "name": "FutureNatural Shoes",
  "price": "84",
  "countInStock": "6",
  "color": "Blue",
  "category": "Shoes",
  "description": "Trends change, but feet remain the same. Made for running and training, these adidas shoes were designed to work with the foot to support natural movement in every direction. A smooth transition between the adidas Primeknit upper and injected PU midsole provides a seamless fit and unrestricted feel. This product is made with recycled content as part of our ambition to end plastic waste. 20% of pieces used to make the upper are made with minimum 50% recycled content.",
  "brand": "adidas",
  "image": "/images/product_25_future_natural_shoes.jpg",
  "rating": "4.5",
  "numReviews": "204"
 },
 {
  "name": "Primegreen Essentials Warm-Up Slim 3-Stripes Track Jacket",
  "price": "40",
  "countInStock": "8",
  "color": "Blue",
  "category": "Clothing",
  "description": "Dash out the door feeling ready for it all. This track jacket has a slim cut with raglan sleeves for a distraction-free feel while warming up or recovering later on. Side pockets keep a bus pass and music player within reach.  This product is made with Primegreen, a series of high-performance recycled materials.",
  "brand": "adidas",
  "image": "/images/product_26_primegreen_essentials_warmup_slim_3Stripes_track_jacket.jpg",
  "rating": "4.7",
  "numReviews": "14"
 }
]